## U.S. Congress DataSet

In [1]:
import pandas as pd
dtypes ={
    "first_name" : "category",
    "gender" : "category",
    "type" : "category",
    "state" : "category",
    "party" : "category"
}
df = pd.read_csv(
    "legislators-historical.csv",
    dtype=dtypes,
    usecols=list(dtypes) + ["birthday", "last_name"],
    parse_dates=["birthday"]
)

In [2]:
df.tail(5)

       last_name first_name   birthday gender type state       party
11978     Hunter     Duncan 1976-12-07      M  rep    CA  Republican
11979    Meadows       Mark 1959-07-28      M  rep    NC  Republican
11980  Ratcliffe       John 1965-10-20      M  rep    TX  Republican
11981      Lewis       John 1940-02-21      M  rep    GA    Democrat
11982     Graves        Tom 1970-02-03      M  rep    GA  Republican

In [3]:
df.dtypes

last_name             object
first_name          category
birthday      datetime64[ns]
gender              category
type                category
state               category
party               category
dtype: object

In [4]:
df

       last_name  first_name   birthday gender type state                party
0        Bassett     Richard 1745-04-02      M  sen    DE  Anti-Administration
1          Bland  Theodorick 1742-03-21      M  rep    VA                  NaN
2          Burke     Aedanus 1743-06-16      M  rep    SC                  NaN
3        Carroll      Daniel 1730-07-22      M  rep    MD                  NaN
4         Clymer      George 1739-03-16      M  rep    PA                  NaN
...          ...         ...        ...    ...  ...   ...                  ...
11978     Hunter      Duncan 1976-12-07      M  rep    CA           Republican
11979    Meadows        Mark 1959-07-28      M  rep    NC           Republican
11980  Ratcliffe        John 1965-10-20      M  rep    TX           Republican
11981      Lewis        John 1940-02-21      M  rep    GA             Democrat
11982     Graves         Tom 1970-02-03      M  rep    GA           Republican

[11983 rows x 7 columns]

In [5]:
#You call .groupby() and pass the name of the column you want to group on, which is "state". 
#Then, you use ["last_name"] to specify the columns on which you want to perform the actual aggregation.
n_by_state = df.groupby("state")["last_name"].count()
n_by_state.tail(10)

state
TN    299
TX    257
UT     53
VA    432
VI      4
VT    115
WA     95
WI    197
WV    120
WY     40
Name: last_name, dtype: int64

In [6]:
n_by_state_gender = df.groupby(["state","gender"])["last_name"].count()
n_by_state_gender

state  gender
AK     F           0
       M          16
AL     F           3
       M         203
AR     F           5
                ...
WI     M         197
WV     F           1
       M         119
WY     F           2
       M          38
Name: last_name, Length: 116, dtype: int64

In [7]:
type(n_by_state_gender)

pandas.core.series.Series

In [8]:
n_by_state_gender.index[:5]

MultiIndex([('AK', 'F'),
            ('AK', 'M'),
            ('AL', 'F'),
            ('AL', 'M'),
            ('AR', 'F')],
           names=['state', 'gender'])

In [9]:
#To more closely emulate the SQL result and push the grouped-on columns back into columns in the result, 
#you an use as_index=False:
df.groupby(["state","gender"],as_index=False)["last_name"].count()

    state gender  last_name
0      AK      F        NaN
1      AK      M       16.0
2      AL      F        3.0
3      AL      M      203.0
4      AR      F        5.0
..    ...    ...        ...
111    WI      M      197.0
112    WV      F        1.0
113    WV      M      119.0
114    WY      F        2.0
115    WY      M       38.0

[116 rows x 3 columns]

In [10]:
by_state = df.groupby("state")
print(by_state)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000013ABFFDFC70>

In [11]:
# Using .count() excludes NaN values, while .size() includes everything, NaN or not.
#One term thatâ€™s frequently used alongside .groupby() is split-apply-combine. This refers to a chain of three steps:

#Split a table into groups
#Apply some operations to each of those smaller tables
#Combine the results
for state , frame in by_state:
    print(f"First 2 entries for {state!r}")
    print("-------------------------------")
    print(frame.head(2), end="\n\n")

First 2 entries for 'AK'
-------------------------------
     last_name first_name   birthday gender type state        party
6618    Waskey      Frank 1875-04-20      M  rep    AK     Democrat
6646      Cale     Thomas 1848-09-17      M  rep    AK  Independent

First 2 entries for 'AL'
-------------------------------
    last_name first_name   birthday gender type state       party
911   Crowell       John 1780-09-18      M  rep    AL  Republican
990    Walker       John 1783-08-12      M  sen    AL  Republican

First 2 entries for 'AR'
-------------------------------
     last_name first_name   birthday gender type state party
1000     Bates      James 1788-08-25      M  rep    AR   NaN
1278    Conway      Henry 1793-03-18      M  rep    AR   NaN

First 2 entries for 'AS'
-------------------------------
          last_name first_name   birthday gender type state     party
10796         Sunia       FofÃ³ 1937-03-13      M  rep    AS  Democrat
11753  Faleomavaega        Eni 1943-08-15      M  rep    AS  Democrat

First 2 entries for 'AZ'
-------------------------------
     last_name first_name   birthday gender type state       party
3673    Poston    Charles 1825-04-20      M  rep    AZ  Republican
3724   Goodwin       John 1824-10-18      M  rep    AZ  Republican

First 2 entries for 'CA'
-------------------------------
     last_name first_name   birthday gender type state        party
2649   Gilbert     Edward        NaT      M  rep    CA     Democrat
2741    Wright     George 1816-06-04      M  rep    CA  Independent

First 2 entries for 'CO'
-------------------------------
     last_name first_name   birthday gender type state  \
3613    Bennet      Hiram 1826-09-02      M  rep    CO
3932  Bradford      Allen 1815-07-23      M  rep    CO

                        party
3613  Conservative Republican
3932               Republican

First 2 entries for 'CT'
-------------------------------
     last_name first_name   birthday gender type state               party
14  Huntington   Benjamin 1736-04-19      M  rep    CT                 NaN
16     Johnson    William 1727-10-07      M  sen    CT  Pro-Administration

First 2 entries for 'DC'
-------------------------------
      last_name first_name   birthday gender type state       party
4231    Chipman     Norton 1834-03-07      M  rep    DC  Republican
10820  Fauntroy     Walter 1933-02-06      M  rep    DC    Democrat

First 2 entries for 'DE'
-------------------------------
   last_name first_name   birthday gender type state                party
0    Bassett    Richard 1745-04-02      M  sen    DE  Anti-Administration
40      Read     George 1733-09-18      M  sen    DE                  NaN

First 2 entries for 'DK'
-------------------------------
     last_name first_name   birthday gender type state     party
3641     Jayne    William 1826-10-08      M  rep    DK       NaN
3686      Todd       John 1814-04-04      M  rep    DK  Democrat

First 2 entries for 'FL'
-------------------------------
      last_name first_name   birthday gender type state party
1030  HernÃ¡ndez     Joseph 1788-05-26      M  rep    FL   NaN
1089       Call    Richard 1792-10-24      M  rep    FL   NaN

First 2 entries for 'GA'
-------------------------------
   last_name first_name   birthday gender type state                party
8        Few    William 1748-06-08      M  sen    GA  Anti-Administration
20   Mathews     George 1739-08-30      M  rep    GA                  NaN

First 2 entries for 'GU'
-------------------------------
      last_name first_name   birthday gender type state       party
10703   Won Pat    Antonio 1908-12-10      M  rep    GU    Democrat
10873      Blaz        Ben 1928-02-14      M  rep    GU  Republican

First 2 entries for 'HI'
-------------------------------
     last_name first_name   birthday gender type state       party
6394    Wilcox     Robert 1855-02-15      M  rep    HI         NaN
7523   Baldwin      Henry 1871-01-12      M  rep    HI  Republican

First 2 entries for 'IA'
-------------------------------
     last_name first_name   birthday gender type state     party
1930   Chapman    William 1808-08-11      M  rep    IA  Democrat
2390  Hastings   Serranus 1813-11-22      M  rep    IA  Democrat

First 2 entries for 'ID'
-------------------------------
     last_name first_name   birthday gender type state       party
3692   Wallace    William 1811-07-19      M  rep    ID  Republican
3845  Holbrook     Edward 1836-05-06      M  rep    ID    Democrat

First 2 entries for 'IL'
-------------------------------
      last_name first_name   birthday gender type state party
595        Bond   Shadrack 1773-11-24      M  rep    IL   NaN
772  Stephenson   Benjamin        NaT      M  rep    IL   NaN

First 2 entries for 'IN'
-------------------------------
    last_name first_name   birthday gender type state       party
431     Parke   Benjamin 1777-09-22      M  rep    IN         NaN
984    Taylor     Waller        NaT      M  sen    IN  Republican

First 2 entries for 'KS'
-------------------------------
      last_name first_name   birthday gender type state       party
3162  Whitfield       John 1818-03-11      M  rep    KS    Democrat
3421    Parrott     Marcus 1828-10-27      M  rep    KS  Republican

First 2 entries for 'KY'
-------------------------------
    last_name   first_name birthday gender type state                party
55    Edwards         John      NaT      M  sen    KY  Anti-Administration
113   Greenup  Christopher      NaT      M  rep    KY           Republican

First 2 entries for 'LA'
-------------------------------
     last_name first_name birthday gender type state       party
584  DestrÃ©han       Jean      NaT      M  sen    LA     Unknown
585   Magruder      Allan      NaT      M  sen    LA  Republican

First 2 entries for 'MA'
-------------------------------
   last_name first_name   birthday gender type state               party
6     Dalton   Tristram 1738-05-28      M  sen    MA  Pro-Administration
12     Grout   Jonathan 1737-07-23      M  rep    MA                 NaN

First 2 entries for 'MD'
-------------------------------
  last_name first_name   birthday gender type state party
3   Carroll     Daniel 1730-07-22      M  rep    MD   NaN
5    Contee   Benjamin        NaT      M  rep    MD   NaN

First 2 entries for 'ME'
-------------------------------
     last_name first_name   birthday gender type state       party
1018      Dane     Joseph 1778-10-25      M  rep    ME  Federalist
1028    Harris       Mark 1779-01-27      M  rep    ME  Republican

First 2 entries for 'MI'
-------------------------------
     last_name first_name   birthday gender type state party
1061    Sibley    Solomon 1769-10-07      M  rep    MI   NaN
1132   Richard    Gabriel 1767-10-15      M  rep    MI   NaN

First 2 entries for 'MN'
-------------------------------
      last_name first_name   birthday gender type state     party
2865     Sibley      Henry 1811-02-20      M  rep    MN       NaN
3240  Kingsbury    William 1828-06-04      M  rep    MN  Democrat

First 2 entries for 'MO'
-------------------------------
     last_name first_name   birthday gender type state party
627  Hempstead     Edward 1780-06-03      M  rep    MO   NaN
712     Easton      Rufus 1774-05-04      M  rep    MO   NaN

First 2 entries for 'MS'
-------------------------------
    last_name  first_name   birthday gender type state party
256    Greene      Thomas 1758-02-26      M  rep    MS   NaN
260    Hunter  Narsworthy        NaT      M  rep    MS   NaN

First 2 entries for 'MT'
-------------------------------
      last_name first_name   birthday gender type state     party
3755     McLean     Samuel 1826-08-07      M  rep    MT  Democrat
3940  Cavanaugh      James 1823-07-04      M  rep    MT  Democrat

First 2 entries for 'NC'
-------------------------------
   last_name first_name   birthday gender type state               party
13   Hawkins   Benjamin 1754-08-15      M  sen    NC  Pro-Administration
17  Johnston     Samuel 1733-12-15      M  sen    NC  Pro-Administration

First 2 entries for 'ND'
-------------------------------
     last_name first_name   birthday gender type state       party
5383     Casey      Lyman 1837-05-06      M  sen    ND  Republican
5478    Pierce    Gilbert 1839-01-11      M  sen    ND  Republican

First 2 entries for 'NE'
-------------------------------
     last_name first_name   birthday gender type state     party
2953  Giddings   Napoleon 1816-01-02      M  rep    NE  Democrat
3067   Chapman       Bird 1821-08-24      M  rep    NE  Democrat

First 2 entries for 'NH'
-------------------------------
    last_name first_name   birthday gender type state       party
99    Wingate      Paine 1739-05-14      M  rep    NH         NaN
120   Langdon       John 1741-06-26      M  sen    NH  Republican

First 2 entries for 'NJ'
-------------------------------
   last_name first_name   birthday gender type state               party
7      Elmer   Jonathan 1745-11-29      M  sen    NJ  Pro-Administration
23  Paterson    William 1745-12-24      M  sen    NJ  Pro-Administration

First 2 entries for 'NM'
-------------------------------
      last_name first_name   birthday gender type state     party
2884  Weightman    Richard 1816-12-28      M  rep    NM  Democrat
3419      Otero     Miguel 1829-06-21      M  rep    NM       NaN

First 2 entries for 'NV'
-------------------------------
        last_name first_name   birthday gender type state       party
3509  Cradlebaugh       John 1819-02-22      M  rep    NV         NaN
3663         Mott     Gordon 1812-10-21      M  rep    NV  Republican

First 2 entries for 'NY'
-------------------------------
         last_name first_name   birthday gender type state party
9            Floyd    William 1734-12-17      M  rep    NY   NaN
26  Van Rensselaer   Jeremiah 1738-08-27      M  rep    NY   NaN

First 2 entries for 'OH'
-------------------------------
    last_name first_name   birthday gender type state       party
226  McMillan    William 1764-03-02      M  rep    OH         NaN
254   Fearing       Paul 1762-02-28      M  rep    OH  Federalist

First 2 entries for 'OK'
-------------------------------
     last_name first_name   birthday gender type state        party
5600    Harvey      David 1845-03-20      M  rep    OK   Republican
6059  Callahan      James 1852-12-19      M  rep    OK  Free Silver

First 2 entries for 'OL'
-------------------------------
    last_name first_name   birthday gender type state party
404     Clark     Daniel        NaT      M  rep    OL   NaN
503   Poydras     Julien 1740-04-03      M  rep    OL   NaN

First 2 entries for 'OR'
-------------------------------
     last_name first_name   birthday gender type state     party
2727  Thurston     Samuel 1816-04-15      M  rep    OR  Democrat
3397      Lane     Joseph 1801-12-14      M  sen    OR  Democrat

First 2 entries for 'PA'
-------------------------------
   last_name first_name   birthday gender type state                party
4     Clymer     George 1739-03-16      M  rep    PA                  NaN
19    Maclay    William 1737-07-20      M  sen    PA  Anti-Administration

First 2 entries for 'PI'
-------------------------------
             last_name first_name   birthday gender type state party
6834            Ocampo      Pablo 1853-01-25      M  rep    PI   NaN
6938  Legarda Y Tuason     Benito 1853-09-27      M  rep    PI   NaN

First 2 entries for 'PR'
-------------------------------
      last_name first_name   birthday gender type state       party
6425    Degetau   Federico 1862-12-05      M  rep    PR  Republican
6810  Larrinaga      Tulio 1847-01-15      M  rep    PR    Unionist

First 2 entries for 'RI'
-------------------------------
    last_name first_name   birthday gender type state       party
61   Bradford    William 1729-11-04      M  sen    RI  Federalist
105    Bourne   Benjamin 1755-09-09      M  rep    RI  Federalist

First 2 entries for 'SC'
-------------------------------
   last_name first_name   birthday gender type state               party
2      Burke    Aedanus 1743-06-16      M  rep    SC                 NaN
15     Izard      Ralph        NaT      M  sen    SC  Pro-Administration

First 2 entries for 'SD'
-------------------------------
     last_name first_name   birthday gender type state       party
5422   Gifford      Oscar 1842-10-20      M  rep    SD  Republican
5461     Moody     Gideon 1832-10-16      M  sen    SD  Republican

First 2 entries for 'TN'
-------------------------------
    last_name first_name   birthday gender type state       party
141     White      James 1749-06-16      M  rep    TN         NaN
142    Blount    William 1749-03-26      M  sen    TN  Republican

First 2 entries for 'TX'
-------------------------------
     last_name first_name   birthday gender type state     party
2567  Pilsbury    Timothy 1789-04-12      M  rep    TX  Democrat
2670   Kaufman      David 1813-12-18      M  rep    TX  Democrat

First 2 entries for 'UT'
-------------------------------
      last_name first_name   birthday gender type state     party
3483  Bernhisel       John 1799-07-23      M  rep    UT      Whig
3646     Kinney       John 1816-04-02      M  rep    UT  Democrat

First 2 entries for 'VA'
-------------------------------
   last_name  first_name   birthday gender type state                party
1      Bland  Theodorick 1742-03-21      M  rep    VA                  NaN
11   Grayson     William        NaT      M  sen    VA  Anti-Administration

First 2 entries for 'VI'
-------------------------------
      last_name first_name   birthday gender type state       party
10495     Evans     Melvin 1917-08-07      M  rep    VI  Republican
11087   de Lugo        Ron 1930-08-02      M  rep    VI    Democrat

First 2 entries for 'VT'
-------------------------------
   last_name first_name   birthday gender type state                party
41  Robinson      Moses 1741-03-22      M  sen    VT  Anti-Administration
86     Niles  Nathaniel 1741-04-03      M  rep    VT                  NaN

First 2 entries for 'WA'
-------------------------------
      last_name first_name   birthday gender type state     party
2978  Lancaster   Columbia 1803-08-26      M  rep    WA  Democrat
3051   Anderson      James 1822-02-16      M  rep    WA  Democrat

First 2 entries for 'WI'
-------------------------------

     last_name first_name   birthday gender type state     party
2409    Martin     Morgan 1805-03-31      M  rep    WI  Democrat
2502   Darling      Mason 1801-05-18      M  rep    WI  Democrat

First 2 entries for 'WV'
-------------------------------
       last_name first_name   birthday gender type state  \
3614       Blair      Jacob 1821-04-11      M  rep    WV
3689  Van Winkle      Peter 1808-09-07      M  sen    WV

                       party
3614  Unconditional Unionist
3689              Republican

First 2 entries for 'WY'
-------------------------------
     last_name first_name   birthday gender type state       party
4008  Nuckolls    Stephen 1825-08-16      M  rep    WY    Democrat
4137     Jones    William 1842-02-20      M  rep    WY  Republican

In [12]:
#he .groups attribute will give you a dictionary of {group name: group label} pairs.
#For example, by_state is a dict with states as keys. Hereâ€™s the value for the "PA" key:
by_state.groups["PA"]

Int64Index([    4,    19,    21,    27,    38,    57,    69,    76,    84,
               88,
            ...
            11840, 11864, 11873, 11875, 11885, 11889, 11930, 11943, 11957,
            11971],
           dtype='int64', length=1053)

In [13]:
#You can also use .get_group() as a way to drill down to the sub-table from a single group:
by_state.get_group("PA")

      last_name first_name   birthday gender type state                party
4        Clymer     George 1739-03-16      M  rep    PA                  NaN
19       Maclay    William 1737-07-20      M  sen    PA  Anti-Administration
21       Morris     Robert 1734-01-20      M  sen    PA   Pro-Administration
27      Wynkoop      Henry 1737-03-02      M  rep    PA                  NaN
38       Jacobs     Israel 1726-06-09      M  rep    PA                  NaN
...         ...        ...        ...    ...  ...   ...                  ...
11889     Brady     Robert 1945-04-07      M  rep    PA             Democrat
11930   Shuster       Bill 1961-01-10      M  rep    PA           Republican
11943   Rothfus      Keith 1962-04-25      M  rep    PA           Republican
11957  Costello       Ryan 1976-09-07      M  rep    PA           Republican
11971    Marino        Tom 1952-08-15      M  rep    PA           Republican

[1053 rows x 7 columns]

In [14]:
#you can grab the initial U.S. state and DataFrame with next().
state, frame = next(iter(by_state))
state

'AK'

In [15]:
#You can see that the result, 16, matches the value for AK in the combined result.
frame["last_name"].count()

16

## News Aggregator DataSet

In [16]:
import datetime as dt
import pandas as pd
def parse_millisecond_timestamp(ts: int) -> dt.datetime:
    """Convert ms since Unix epoch to UTC datetime instance."""
    return dt.datetime.fromtimestamp(ts / 1000, tz=dt.timezone.utc)

df = pd.read_csv(
    "newsCorpora.csv",
    sep="\t",
    header=None,
    index_col=0,
    names=["title", "url", "outlet", "category", "cluster", "host", "tstamp"],
    parse_dates=["tstamp"],
    date_parser=parse_millisecond_timestamp,
    dtype={
        "outlet": "category",
        "category": "category",
        "cluster": "category",
        "host": "category",
    },
)

In [17]:
df

,title,url,outlet,category,cluster,host,tstamp
1,"Fed official says weak data caused by weather,...",http://www.latimes.com/business/money/la-fi-mo...,Los Angeles Times,b,ddUyU0VZz0BRneMioxUPQVP6sIxvM,www.latimes.com,2014-03-10 16:52:50.698000+00:00
2,Fed's Charles Plosser sees high bar for change...,http://www.livemint.com/Politics/H2EvwJSK2VE6O...,Livemint,b,ddUyU0VZz0BRneMioxUPQVP6sIxvM,www.livemint.com,2014-03-10 16:52:51.207000+00:00
3,US open: Stocks fall after Fed official hints ...,http://www.ifamagazine.com/news/us-open-stocks...,IFA Magazine,b,ddUyU0VZz0BRneMioxUPQVP6sIxvM,www.ifamagazine.com,2014-03-10 16:52:51.550000+00:00
4,"Fed risks falling 'behind the curve', Charles ...",http://www.ifamagazine.com/news/fed-risks-fall...,IFA Magazine,b,ddUyU0VZz0BRneMioxUPQVP6sIxvM,www.ifamagazine.com,2014-03-10 16:52:51.793000+00:00
5,Fed's Plosser: Nasty Weather Has Curbed Job Gr...,http://www.moneynews.com/Economy/federal-reser...,Moneynews,b,ddUyU0VZz0BRneMioxUPQVP6sIxvM,www.moneynews.com,2014-03-10 16:52:52.027000+00:00
...,...,...,...,...,...,...,...
422933,Surgeons to remove 4-year-old's rib to rebuild...,http://www.cbs3springfield.com/story/26378648/...,WSHM-TV,m,dpcLMoJD69UYMXMxaoEFnWql9YjQM,www.cbs3springfield.com,2014-08-28 12:33:10.251000+00:00
422934,Boy to have surgery on esophagus after battery...,http://www.wlwt.com/news/boy-to-have-surgery-o...,WLWT Cincinnati,m,dpcLMoJD69UYMXMxaoEFnWql9YjQM,www.wlwt.com,2014-08-28 12:33:10.508000+00:00
422935,Child who swallowed battery to have reconstruc...,http://www.newsnet5.com/news/local-news/child-...,NewsNet5.com,m,dpcLMoJD69UYMXMxaoEFnWql9YjQM,www.newsnet5.com,2014-08-28 12:33:10.771000+00:00
422936,Phoenix boy undergoes surgery to repair throat...,http://www.wfsb.com/story/26368078/phoenix-boy...,WFSB,m,dpcLMoJD69UYMXMxaoEFnWql9YjQM,www.wfsb.com,2014-08-28 12:33:11.071000+00:00
422937,Phoenix boy undergoes surgery to repair throat...,http://www.cbs3springfield.com/story/26368078/...,WSHM-TV,m,dpcLMoJD69UYMXMxaoEFnWql9YjQM,www.cbs3springfield.com,2014-08-28 12:33:11.565000+00:00

In [18]:
df.iloc[0]

title       Fed official says weak data caused by weather,...
url         http://www.latimes.com/business/money/la-fi-mo...
outlet                                      Los Angeles Times
category                                                    b
cluster                         ddUyU0VZz0BRneMioxUPQVP6sIxvM
host                                          www.latimes.com
tstamp                       2014-03-10 16:52:50.698000+00:00
Name: 1, dtype: object

### Using Lambda Functions in .groupby()

In [19]:
#To count mentions by outlet, you can call .groupby() on the outlet, and then quite literally .apply() a function on each group: 
df.groupby("outlet", sort=False)["title"].apply(
    lambda ser: ser.str.contains("Fed").sum()
).nlargest(10)

outlet
Reuters                         161
NASDAQ                          103
Businessweek                     93
Investing.com                    66
Wall Street Journal \(blog\)     61
MarketWatch                      56
Moneynews                        55
Bloomberg                        53
GlobalPost                       51
Economic Times                   44
Name: title, dtype: int64

In [20]:
#Letâ€™s break this down since there are several method calls made in succession.
#Like before, you can pull out the first group and its corresponding Pandas object by taking
#the first tuple from the Pandas GroupBy iterator:
title, ser = next(iter(df.groupby("outlet", sort=False)["title"]))
title

'Los Angeles Times'

In [21]:
#Next comes .str.contains("Fed").
#This returns a Boolean Series that is True when an article title registers a match on the search.
ser.str.contains("Fed")

1          True
486       False
1124      False
1146      False
1237      False
          ...
421547    False
421584    False
421972    False
422226    False
422905    False
Name: title, Length: 1976, dtype: bool

In [22]:
#The next step is to .sum() this Series. 
#Since bool is technically just a specialized type of int, 
#you can sum a Series of True and False just as you would sum a sequence of 1 and 0:
ser.str.contains("Fed").sum()

17